<?php

/* @var $this yii\web\View */

use yii\helpers\Html;

$this->title = 'ประวัติความเป็นมา';
$this->params['breadcrumbs'][] = $this->title;
?>
<div class="container well">
    <h3><i class="fa fa-tag fa-lg"></i> ประวัติความเป็นมา</h3>
    <div class="progress">
        <div class="progress-bar"></div>
    </div>

    <p><?php echo str_repeat("&nbsp;", 10); ?>
        อำเภอท่าสองยาง เดิมเป็นหมู่บ้านชื่อว่า "ต่าซ่องยาง" (ต่า แปลว่า ท่าน้ำ , ซ่อง  แปลว่า ช่อง , ยาง แปลว่า ชาวกะเหรี่ยง) ประชากรส่วนใหญ่เป็นชาวพื้นเมืองเผ่ากะเหรี่ยง ในสมัยก่อนนั้นมีแต่ชาวพื้นเมืองเผ่ากะเหรี่ยง      ข้ามแม่น้ำเมยไปมาหาสู่หรือค้าขายกัน แต่เมื่อมีคนไทยจากอำเภอแม่สะเรียง จังหวัดแม่ฮ่องสอน เดินทางเข้ามาค้าขายของป่ากับชาวกะเหรี่ยงในพื้นที่ จึงมีคนไทยเหนือ ไทยใหญ่ เข้ามาอาศัยอยู่มากขึ้น 
    </p>
    <p><?php echo str_repeat("&nbsp;", 10); ?>
        อำเภอท่าสองยาง เดิมมีฐานะเป็นกิ่งอำเภอที่ขึ้นอยู่ในเขตการปกครองของอำเภอแม่สะเรียง จังหวัดแม่ฮ่องสอน ต่อมาเมื่อปี พ.ศ. 2491 ได้ตัดโอนมาขึ้นกับอำเภอแม่สอด จังหวัดตาก และเมื่อปี พ.ศ. 2494 เมื่อ    กิ่งอำเภอแม่ระมาด ได้รับการยกฐานะขึ้นเป็นอำเภอแม่ระมาด กิ่งอำเภอท่าสองยาง จึงได้โอนไปขึ้นอยู่กับอำเภอ        แม่ระมาด แล้วต่อจึงได้รับการยกฐานะขึ้นเป็นอำเภอท่าสองยาง เมื่อวันที่ 22 กรกฎาคม 2501 จนถึงปัจจุบันนี้
    </p>
    <p><?php echo str_repeat("&nbsp;", 10); ?>
        เมื่อครั้งยังเป็นกิ่งอำเภออยู่ในเขตการปกครองของอำเภอแม่สะเรียงนั้น ที่ว่าการอำเภอตั้งอยู่ที่หมู่บ้านท่าสองยาง หมู่ที่ 1 ตำบลท่าสองยาง ต่อมาเมื่อได้ตัดโอนมาอยู่ในเขตการปกครองของจังหวัดตาก จึงได้ย้ายที่ว่าการกิ่งอำเภอท่าสองยาง มาตั้งอยู่ที่หมู่บ้านบ้านแม่ต้าน หมู่ที่ 1 ตำบลแม่ต้าน ซึ่งเป็นที่ตั้งที่ว่าการอำเภอท่าสองยางในปัจจุบัน ส่วนสาเหตุที่ย้ายก็เนื่องมาจาก หมู่บ้านแม่ต้านเป็นหมู่บ้านที่มีจำนวนราษฎรอยู่หนาแน่นสะดวกในการเดินทางติดต่อไปมาของราษฎรในพื้นที่
    </p>
    <p><?php echo str_repeat("&nbsp;", 10); ?>
        อำเภอท่าสองยาง เป็นอำเภอชายแดนอยู่ทางด้านทิศตะวันตกเฉียงเหนือของจังหวัดตาก มีพื้นที่ ๑,๙๒๐.๓๘ ตารางกิโลเมตร ความหนาแน่นของประชากร เท่ากับ ๓๔.๖๑ คน / ตารางกิโลเมตร มีระยะทางห่างจากตัวจังหวัดตาก ๑๖๐ กิโลเมตร โดยมีอาณาเขตติดต่อดังนี้
    </p>
    <p>
        <div class="row">
            <center>
                <img class="col-sm-8 col-sm-offset-2" src="<?= Yii::getAlias('@web') ?>/img/thasongyang_map.png" height="50%" width="50%">
            </center>
        </div>
    <br>
    <p align="center">ภาพที่ ๑  แผนที่แสดงที่ตั้งและอาณาเขตอำเภอท่าสองยาง จังหวัดตาก</p>
    </p>
    <p>
        <h4>ข้อมูลอาณาเขตติดต่อ</h4>
        <?php echo str_repeat("&nbsp;", 10); ?>๑.	ทิศเหนือติดต่อกับ อำเภอสบเมย จังหวัดแม่ฮ่องสอน<br>
        <?php echo str_repeat("&nbsp;", 10); ?>๒.	ทิศตะวันออกติดกับ อำเภออมก๋อย จังหวัดเชียงใหม่<br> 
        <?php echo str_repeat("&nbsp;", 10); ?>๓.	ทิศใต้ติดต่อกับ อำเภอแม่ระมาด จังหวัดตาก<br>
        <?php echo str_repeat("&nbsp;", 10); ?>๔.	ทิศตะวันตกติดต่อกับประเทศสหภาพเมียนมาร์ โดยมีแม่น้ำเมย ซึ่งเป็นพรมแดนธรรมชาติกั้นระหว่างประเทศไทย และ สหภาพเมียนมาร์ ซึ่งมีระยะทางยาว ๑๕๐ กิโลเมตร จากเหนือจรดใต้<br>
    </p>
    <p>
    <h4>ข้อมูลภูมิประเทศ</h4>
        <?php echo str_repeat("&nbsp;", 10); ?>
        สภาพภูมิประเทศ ร้อยละ ๙๐ เป็นภูเขาและเทือกเขาสูง และพื้นที่ส่วนใหญ่อยู่ในเขตป่าสงวนมีเทือกเขาถนนธงชัยทอดผ่านจากเหนือลงใต้ และมีที่ราบริมแม่น้ำเพียงเล็กน้อย สภาพ ภูมิอากาศเป็นแบบมรสุมเมืองร้อน โดยในฤดูฝนจะได้รับอิทธิพลจากมรสุมตะวันตกเฉียงใต้มาปะทะกับด้านรับลมของเทือกเขาถนนธงชัย ทำให้มีฝนตกชุกมาก โดยในฤดูฝนจะเริ่มจากเดือน พฤษภาคม ถึง ตุลาคม และในฤดูหนาวมีอากาศหนาวจัด โดยเฉพาะในพื้นที่ภูเขาสูง อาจมีอุณหภูมิต่ำกว่า ๘ องศาเซลเซียส ซึ่งจากสภาพภูมิประเทศ และภูมิอากาศดังกล่าว ทำให้การคมนาคมภายในอำเภอท่าสองยาง ค่อนข้างยากลำบากโดยมีถนนสายหลัก อยู่เพียง ๒ เส้นทาง นอกนั้นเป็นถนนลำลอง และถนนลูกรัง โดยเฉพาะในช่วงฤดูฝน พื้นที่ส่วนใหญ่ร้อยละ 70 รถยนต์ไม่สามารถเข้าไปในพื้นที่ได้ ต้องใช้จักรยานยนต์ หรือการเดินเท้าเพียงอย่างเดียว
    </p>
</div>
